Revit 2027 API
RebarShapeVertex.BendAngle Property
 The range of permissible angles at this bend.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeBendAngle BendAngle { get; set; }
Public Property BendAngle As RebarShapeBendAngle
	Get
	Set
public:
property RebarShapeBendAngle BendAngle {
	RebarShapeBendAngle get ();
	void set (RebarShapeBendAngle value);
}
member BendAngle : RebarShapeBendAngle with get, set
Property Value
RebarShapeBendAngle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace